{
  "pt": {
    "menu_home": "Início",
    "menu_skills": "Especialidades",
    "menu_about": "Sobre",
    "menu_projects": "Projetos",
    "btn_contact": "Contato",
    "logo_alt": "Logo Luciano Bruno",
    "main_title": "LUCIANO BRUNO - FULL STACK DEVELOPER",
    "main_description": "Sou um desenvolvedor Full Stack que sempre tenta criar experiências digitais incríveis. Sou comprometido com código limpo, trabalho em equipe e gestão de tempo. Explore meu portfólio para descobrir alguns projetos feitos de forma individual e em grupo, comprovando minhas habilidades e comprometimento com o desenvolvimento de sistemas, sejam eles robustos ou simples.",
    "btn_contact_me": "Entre em contato",
    "menu_xp_profissional": "Experiência profissional",



    "skills_title": "MINHAS <br> ESPECIALIDADES.",
    "java_desc": "O Java é uma linguagem de programação versátil e orientada a objetos, conhecida por sua portabilidade, permitindo a execução de código em diferentes sistemas. Amplamente utilizado no desenvolvimento de aplicativos corporativos, móveis e web, Java oferece robustez e flexibilidade.",
    "csharp_desc": "O C# é uma linguagem de programação desenvolvida pela Microsoft, destacando-se no desenvolvimento de aplicativos Windows e aplicações web. Suportando programação orientada a objetos e integrando-se ao ecossistema .NET, C# oferece poder e eficiência no desenvolvimento de software.",
    "sql_desc": "SQL (Structured Query Language) é uma linguagem de programação projetada para gerenciar e manipular bancos de dados relacionais. Amplamente utilizada em sistemas de gerenciamento de banco de dados (SGBD), como MySQL, PostgreSQL e Microsoft SQL Server, o SQL é fundamental para interagir com dados de maneira eficiente.",
    "html_desc": "O HTML5 é uma linguagem de marcação essencial para a construção de páginas web modernas. Introduzindo elementos e recursos avançados, como áudio, vídeo e gráficos, o HTML5 possibilita a criação de aplicações web mais interativas e responsivas.",
    "css_desc": "O CSS3, por sua vez, é a ferramenta para estilizar documentos HTML. Com recursos avançados de design, como transições, animações e sombras, o CSS3 é crucial para a criação de layouts flexíveis e responsivos, proporcionando uma experiência visual aprimorada.",
    "git_desc": "O Git, um sistema de controle de versão distribuído, revoluciona a gestão de código-fonte. Facilitando o rastreamento de alterações em projetos de software, Git promove a colaboração eficiente entre desenvolvedores.",
    "github_desc": "O GitHub, como plataforma de hospedagem para repositórios Git, desempenha um papel crucial na colaboração e na gestão de projetos. Amplamente utilizado para projetos de código aberto, GitHub é essencial para revisão de código e controle de versão.",
    "python_desc": "O Python é uma linguagem de programação de alto nível, muito conhecida pela sua simplicidade, legibilidade e versatilidade. Sua sintaxe clara e intuitiva facilita tanto o aprendizado quanto o desenvolvimento, tornando-a uma das linguagens mais populares do mundo. Com uma ampla variedade de aplicações, Python é utilizado em desenvolvimento web, automação, análise e visualização de dados, inteligência artificial, aprendizado de máquina, entre muitas outras áreas.\n\nSua grande comunidade e o vasto ecossistema de bibliotecas e frameworks permitem acelerar o desenvolvimento de projetos robustos e eficientes. Além disso, Python prioriza a produtividade do desenvolvedor, tornando o código mais limpo, organizado e fácil de manter, seja em pequenos scripts ou em grandes sistemas.",
    "django_desc": "Django é um framework web de alto nível para desenvolvimento em Python, que facilita a criação rápida e segura de aplicações web robustas e escaláveis. Ele segue o padrão Model-View-Template (MVT) e oferece uma série de recursos integrados, como sistema de autenticação, painel administrativo, ORM para manipulação de banco de dados, roteamento de URLs e proteção contra vulnerabilidades comuns. Seu design “batteries-included” permite acelerar o desenvolvimento, focando na reutilização de componentes e na simplicidade, sendo amplamente utilizado em projetos de diferentes portes.",
    "javascript_desc": "JavaScript é uma linguagem de programação leve, amplamente utilizada no desenvolvimento web para tornar páginas interativas e dinâmicas. Junto com HTML e CSS, compõe a base da maioria dos sites modernos. Com JavaScript, é possível criar desde animações e validações de formulários até aplicações completas no lado do cliente e servidor, utilizando frameworks e bibliotecas como React, Vue.js e Node.js.",
    "kotlin_desc": "Kotlin é uma linguagem de programação moderna, concisa e segura, desenvolvida pela JetBrains. É amplamente utilizada para o desenvolvimento de aplicativos Android, sendo totalmente interoperável com Java. Além do Android, Kotlin também pode ser usado para desenvolvimento web, backend, desktop e até multiplataforma, graças ao Kotlin Multiplatform. Sua sintaxe limpa e recursos avançados tornam o desenvolvimento mais produtivo e menos propenso a erros.",
    "net_desc": ".NET é uma plataforma de desenvolvimento criada pela Microsoft, utilizada para construir aplicações modernas, seguras e escaláveis. Suporta diversas linguagens de programação, como C#, F# e Visual Basic, e permite o desenvolvimento para web, desktop, mobile, nuvem e APIs. Com seu ambiente robusto e suporte ao padrão MVC, o .NET é amplamente adotado em soluções corporativas e sistemas de grande porte.",



    "h1-xp-profissional": "EXPERIÊNCIA PROFISSIONAL",
    "titulo-xp-profissional": "Secretaria de desenvolvimento urbano, tecnologia e meio ambiente.",
    "cargo-profissional": "Estagiário em desenvolvimento FULL-STACK",
    "periodo": "Agosto 2024 - atualmente",
    "xp-item1":"Levantamento e análise de requisitos para diferentes projetos de software.",
    "xp-item2":"Desenvolvimento e manutenção de sistemas web com Python, Django, ReactJS, Firebase e PostgreSQL",
    "xp-item3": "Criação e implementação de interfaces web responsivas utilizando HTML, CSS e JavaScript.",
    "xp-item4":" Aplicação de metodologias ágeis (Scrum/Kanban) para gerenciamento de projetos e entregas iterativas.",
    "xp-item5": "Desenvolvimento de automações e sistemas de notificações para otimizar processos e melhorar a experiência do usuário.",
    "xp-item6": "Testes automatizados e manuais para garantir qualidade e estabilidade do software.",
    "xp-item7": "Colaboração em equipes multidisciplinares, promovendo comunicação efetiva entre áreas de negócio e tecnologia.",



    "hello-i-am": "Olá, sou <span> Luciano Bruno!</span>",
    "about-paragraph-1": "Me chamo Luciano, sou um desenvolvedor full stack, com experiência profissional em desenvolvimento web utilizando tecnologias como Python, HTML, CSS, JavaScript, postgres, entre outras. Atuo na criação de aplicações completas, do backend ao frontend, com foco em soluções funcionais, responsivas e bem estruturadas. Além disso, tenho experiência em projetos na área de ciência de dados e aprendizado de máquina, aplicando técnicas de análise, pré-processamento e modelagem preditiva em diferentes contextos. Estou sempre em busca de novos desafios que ampliem meu conhecimento e contribuam para a construção de soluções tecnológicas de impacto.",
    "about-paragraph-2": "Um dos meus maiores sonhos é poder usar a tecnologia para construir ferramentas que possam mudar para melhor a vida das pessoas, impactando no dia a dia de forma a tornar suas rotinas muito mais agradáveis. A programação é uma fonte infinita de possibilidades que podem ser exploradas das mais diversas formas possíveis, eu quero utilizá-la para transformar o mundo em um lugar melhor!",



    "portfolio.title": "MEUS <span>PROJETOS</span>",
    "project1.title": "TRAVEL DIARY",
    "project1.description": "O Travel Diary é um aplicativo para viajantes que desejam documentar suas experiências de forma prática e interativa. Com uma interface intuitiva e recursos personalizados, o aplicativo permite que os usuários criem diários de viagem detalhados, adicionando informações sobre os lugares visitados, suas coordenadas geográficas e muito mais.",
    "project1.link": "Ver no GitHub",
    "project2.title": "MONITORAMENTO AMBIENTAL",
    "project2.description": "Software voltado para o acompanhamento eficiente de licenças e condicionantes ambientais, garantindo o cumprimento das exigências legais. O sistema permite o cadastro detalhado de licenças e suas condicionantes, monitorando prazos e status de validade em tempo real. Além disso, conta com envio automático de alertas para antecipar possíveis descumprimentos, facilitando a gestão ambiental e mitigando riscos regulatórios. Solicitado pela prefeitura de Paulista, Pernambuco.",
    "project2.link": "REPOSITÓRIO PRIVADO",
    "project3.title": "CHAT WEB",
    "project3.description": "API para uma aplicação de chat web em tempo real, utilizando a linguagem Python com o framework Flask. A aplicação conta com uma interface desenvolvida em HTML, CSS e JavaScript, oferecendo uma experiência de usuário fluida e interativa.",
    "project3.link": "Ver no GitHub",
    "project4.title": "APRENDER MAIS",
    "project4.description": "O Aprender Mais é uma aplicação web desenvolvida com o objetivo de democratizar o acesso ao conhecimento por meio de uma plataforma gratuita de educação online. O sistema permite a publicação e o gerenciamento de aulas por administradores voluntários, abrangendo diversas áreas do saber. Com foco na usabilidade, a plataforma busca facilitar o aprendizado autônomo, oferecendo conteúdos organizados e acessíveis a qualquer pessoa interessada em expandir seus conhecimentos.",
    "project4.link": "Ver no GitHub",
    "project5.title": "API DE PRODUTOS",
    "project5.description": "API RESTful desenvolvida com Java e Spring Boot, voltada para a consolidação de conhecimentos em desenvolvimento backend. O projeto segue as boas práticas de arquitetura REST, com endpoints organizados para operações de CRUD, tratamento de exceções, validação de dados e persistência com JPA e banco de dados relacional. Trata-se de uma aplicação simples, mas estruturada, ideal para estudos e experimentações com serviços web modernos.",
    "project5.link": "Ver no GitHub",
    "project6.title": "CINEMA IFPE",
    "project6.description": "O CINEMA IFPE é um sistema desenvolvido para gerenciar de forma eficiente a bilheteria de um cinema, oferecendo uma experiência prática e intuitiva aos usuários. A aplicação permite a compra de bilhetes, consulta de filmes em exibição e lançamentos, verificação de poltronas disponíveis em tempo real, além da aquisição de lanches. Após a finalização da compra, os ingressos são automaticamente enviados por e-mail, garantindo conveniência e segurança no acesso às sessões.",
    "project6.link": "Ver no GitHub",
    "project7.title": "PREVISÃO DE TIPOS DE CHUVA",
    "project7.description": "Projeto desenvolvido com foco na classificação automática de tipos de chuva a partir de dados meteorológicos, utilizando a base Weather Type Classification do Kaggle. Foram aplicados algoritmos de machine learning, como Random Forest, KNN e Regressão Logística, para prever padrões de precipitação e apoiar decisões em setores como o agrícola. O modelo com melhor desempenho (Random Forest) alcançou acurácia superior a 91%.",
    "project7.link": "Ver no GitHub",
    "project8.title": "PREDIÇÃO DE MAL DE PARKINSON",
    "project8.description": "Projeto desenvolvido com foco na predição da progressão dos sintomas do Mal de Parkinson, utilizando o conjunto de dados Parkinson’s Disease MDS-UPDRS do Kaggle. Foram aplicadas técnicas de aprendizado de máquina para modelar e prever os escores das escalas clínicas UPDRS, com o objetivo de contribuir para o monitoramento da evolução da doença. O projeto envolveu etapas de pré-processamento, seleção de atributos e avaliação de modelos preditivos.",
    "project8.link": "Ver no GitHub",
    "project9.title": "PLANEJAMENTO DE VIAGENS",
    "project9.description": "Software desenvolvido com Python 3.12, Django e SQLite no backend, e HTML, CSS e JavaScript no frontend. A aplicação conta com funcionalidades como registro e login de usuários, gerenciamento de destinos e usuários por administradores, criação e edição de listas de desejos para usuários registrados, além de envio de e-mails para a administração do sistema. O sistema foi projetado para oferecer uma experiência completa e intuitiva tanto para administradores quanto para usuários finais.",
    "project9.link": "Ver no Github",



    "contact.title": "FALA COMIGO",
    "contact.namePlaceholder": "seu nome ou nome da empresa",
    "contact.emailPlaceholder": "seu email",
    "contact.messagePlaceholder": "sua mensagem",
    "contact.sendButton": "ENVIAR",
    "footer.email": "luciaanobruno@gmail.com",



    "thank-you":"OBRIGADO!",
    "return-portfolio": "Voltar ao portfolio"
  },




  "en": {
    "menu_home": "Home",
    "menu_skills": "Skills",
    "menu_about": "About",
    "menu_projects": "Projects",
    "menu_xp_profissional": "Professional Experience",
    "btn_contact": "Contact",
    "logo_alt": "Luciano Bruno Logo",
    "main_title": "LUCIANO BRUNO - FULL STACK DEVELOPER",
    "main_description": "I am a Full Stack developer always striving to create amazing digital experiences. I am committed to clean code, teamwork, and time management. Explore my portfolio to discover some projects done individually and in groups, demonstrating my skills and commitment to system development, whether robust or simple.",
    "btn_contact_me": "Get in touch",



    "skills_title": "MY <br> SKILLS.",
    "java_desc": "Java is a versatile, object-oriented programming language known for its portability, allowing code to run on different systems. Widely used in the development of corporate, mobile, and web applications, Java offers robustness and flexibility.",
    "csharp_desc": "C# is a programming language developed by Microsoft, standing out in the development of Windows applications and web applications. Supporting object-oriented programming and integrating with the .NET ecosystem, C# offers power and efficiency in software development.",
    "sql_desc": "SQL (Structured Query Language) is a programming language designed to manage and manipulate relational databases. Widely used in database management systems (DBMS) such as MySQL, PostgreSQL, and Microsoft SQL Server, SQL is essential for interacting with data efficiently.",
    "html_desc": "HTML5 is an essential markup language for building modern web pages. Introducing advanced elements and features such as audio, video, and graphics, HTML5 enables the creation of more interactive and responsive web applications.",
    "css_desc": "CSS3, in turn, is the tool used to style HTML documents. With advanced design features such as transitions, animations, and shadows, CSS3 is crucial for creating flexible and responsive layouts, providing an enhanced visual experience.",
    "git_desc": "Git, a distributed version control system, revolutionizes source code management. By facilitating the tracking of changes in software projects, Git promotes efficient collaboration among developers.",
    "github_desc": "GitHub, as a hosting platform for Git repositories, plays a crucial role in collaboration and project management. Widely used for open source projects, GitHub is essential for code review and version control.",
    "python_desc": "Python is a high-level programming language widely known for its simplicity, readability, and versatility. Its clear and intuitive syntax makes it easy to learn and efficient to develop with, making it one of the most popular languages in the world. Python is used in a wide range of applications, including web development, automation, data analysis, data visualization, artificial intelligence, machine learning, and more.\n\nWith a large community and a vast ecosystem of libraries and frameworks, Python enables developers to build robust and efficient projects faster. Additionally, Python prioritizes developer productivity by making code cleaner, more organized, and easier to maintain — whether for small scripts or large-scale systems.",
    "django_desc": "Django is a high-level web framework for Python development that facilitates the rapid and secure creation of robust and scalable web applications. It follows the Model-View-Template (MVT) pattern and offers a range of built-in features, such as an authentication system, admin panel, ORM for database management, URL routing, and protection against common vulnerabilities. Its “batteries-included” design accelerates development by focusing on component reuse and simplicity, making it widely used in projects of various sizes.",
    "javascript_desc": "JavaScript is a lightweight programming language widely used in web development to make pages interactive and dynamic. Along with HTML and CSS, it forms the foundation of most modern websites. JavaScript enables the creation of everything from animations and form validations to full client-side and server-side applications using frameworks and libraries like React, Vue.js, and Node.js.",
    "kotlin_desc": "Kotlin is a modern, concise, and safe programming language developed by JetBrains. It is widely used for Android app development and is fully interoperable with Java. Beyond Android, Kotlin can also be used for web, backend, desktop, and even cross-platform development thanks to Kotlin Multiplatform. Its clean syntax and advanced features make development more productive and less error-prone.",
    "net_desc": ".NET is a development platform created by Microsoft, used to build modern, secure, and scalable applications. It supports multiple programming languages, such as C#, F#, and Visual Basic, and enables development for web, desktop, mobile, cloud, and APIs. With its robust environment and MVC pattern support, .NET is widely adopted in enterprise solutions and large-scale systems.",



    "hello-i-am": "Hello, I am <span> Luciano Bruno!</span>",
    "about-paragraph-1": "My name is Luciano, I am a full stack developer with professional experience in web development using technologies like Python, HTML, CSS, JavaScript, Postgres, among others. I work on creating complete applications, from backend to frontend, focusing on functional, responsive, and well-structured solutions. Additionally, I have experience in projects in the field of data science and machine learning, applying techniques of analysis, preprocessing, and predictive modeling in different contexts. I am always looking for new challenges that expand my knowledge and contribute to building impactful technological solutions.",
    "about-paragraph-2": "One of my biggest dreams is to use technology to build tools that can positively change people's lives, impacting their daily routines to make them much more pleasant. Programming is an infinite source of possibilities that can be explored in many ways, and I want to use it to transform the world into a better place!",



    "h1-xp-profissional": "PROFESSIONAL EXPERIENCE",
    "titulo-xp-profissional": "Department of Urban Development, Technology and Environment",
    "cargo-profissional": "Full Stack Intern",
    "periodo": "August/2024 - October/2025",
    "xp-item1": "Requirement gathering and analysis for various software projects.",
    "xp-item2": "Development and maintenance of web systems using Python, Django, ReactJS, Firebase, and PostgreSQL.",
    "xp-item3": "Design and implementation of responsive web interfaces using HTML, CSS, and JavaScript.",
    "xp-item4": "Application of Agile methodologies (Scrum/Kanban) for project management and iterative deliveries.",
    "xp-item5": "Development of automation workflows and notification systems to optimize processes and improve user experience.",
    "xp-item6": "Automated and manual testing to ensure software quality and stability.",
    "xp-item7": "Collaboration within multidisciplinary teams, fostering effective communication between business and technology areas.",



    "portfolio.title": "MY <span>PROJECTS</span>",
    "project1.title": "TRAVEL DIARY",
    "project1.description": "Travel Diary is an app for travelers who want to document their experiences in a practical and interactive way. With an intuitive interface and personalized features, the app allows users to create detailed travel journals, adding information about the places visited, their geographic coordinates, and much more.",
    "project1.link": "View on GitHub",
    "project2.title": "ENVIRONMENTAL MONITORING",
    "project2.description": "Software designed for efficient monitoring of environmental licenses and conditions, ensuring compliance with legal requirements. The system allows detailed registration of licenses and their conditions, monitoring deadlines and validity status in real time. Additionally, it features automatic alert notifications to anticipate potential non-compliance, facilitating environmental management and mitigating regulatory risks. Requested by the municipality of Paulista, Pernambuco, Brazil.",
    "project2.link": "PRIVATE REPOSITORY",
    "project3.title": "WEB CHAT",
    "project3.description": "API for a real-time web chat application using Python with the Flask framework. The application features an interface developed with HTML, CSS, and JavaScript, providing a smooth and interactive user experience.",
    "project3.link": "View on GitHub",
    "project4.title": "APRENDER MAIS",
    "project4.description": "Aprender Mais is a web application developed with the goal of democratizing access to knowledge through a free online education platform. The system allows volunteer administrators to publish and manage lessons covering various fields of knowledge. Focused on usability, the platform aims to facilitate self-directed learning by offering organized and accessible content to anyone interested in expanding their knowledge.",
    "project4.link": "View on GitHub",
    "project5.title": "PRODUCTS API",
    "project5.description": "RESTful API developed with Java and Spring Boot, aimed at consolidating knowledge in backend development. The project follows REST architecture best practices, with endpoints organized for CRUD operations, exception handling, data validation, and persistence using JPA and a relational database. It is a simple yet well-structured application, ideal for study and experimentation with modern web services.",
    "project5.link": "View on GitHub",
    "project6.title": "CINEMA IFPE",
    "project6.description": "CINEMA IFPE is a system developed to efficiently manage a cinema's box office, providing users with a practical and intuitive experience. The application allows ticket purchases, browsing currently showing and upcoming movies, real-time seat availability checking, and snack purchases. After completing the purchase, tickets are automatically sent via email, ensuring convenience and security for accessing the sessions.",
    "project6.link": "View on GitHub",
    "project7.title": "RAIN TYPE FORECAST",
    "project7.description": "Project developed focusing on the automatic classification of rain types based on meteorological data, using the Weather Type Classification dataset from Kaggle. Machine learning algorithms such as Random Forest, KNN, and Logistic Regression were applied to predict precipitation patterns and support decision-making in sectors like agriculture. The best performing model (Random Forest) achieved accuracy above 91%.",
    "project7.link": "View on GitHub",
    "project8.title": "PARKINSON'S DISEASE PREDICTION",
    "project8.description": "Project developed focusing on predicting the progression of Parkinson’s disease symptoms, using the Parkinson’s Disease MDS-UPDRS dataset from Kaggle. Machine learning techniques were applied to model and predict the scores of the clinical UPDRS scales, aiming to contribute to monitoring disease progression. The project involved preprocessing, feature selection, and evaluation of predictive models.",
    "project8.link": "View on GitHub",
    "project9.title": "TRAVEL PLANNING",
    "project9.description": "Software developed using Python 3.12, Django, and SQLite on the backend, with HTML, CSS, and JavaScript on the frontend. The application includes features such as user registration and login, destination and user management by administrators, creation and editing of wishlists for registered users, and email communication with system administrators. The system was designed to provide a complete and intuitive experience for both administrators and end users.",
    "project9.link": "View on github",



    "contact.title": "TALK TO ME",
    "contact.namePlaceholder": "your name or company name",
    "contact.emailPlaceholder": "your email",
    "contact.messagePlaceholder": "your message",
    "contact.sendButton": "SEND",
    "footer.email": "luciaanobruno@gmail.com",



    "thank-you": "THANK YOU!",
    "return-portfolio": "Return to main page"
  }
}
